# menu motion
ADMIN_BUTTON_MAIN_MENU="⬆️Main menu⬆️"
ADMIN_BUTTON_MAIN_ADMIN_MENU='🛠️Admin menu🛠️'
ADMIN_BUTTON_BACK_TO_MAIN_ADMIN_MENU='⬆️Admin menu⬆️'


# admin invitings
ADMIN_INVITE_PRESS_ANY_BUTTON= "🕹Press any button👇"
ADMIN_INVITE_CHOOSE_AND_PRESS_ANY= "📌Choose any and tap it👇"
ADMIN_INVITE_CHOOSE_BUTTON= 'Выберите действие'


# maim admin menu
ADMIN_BUTTON_ADDING_MENU= '✍️Adding menu✍️'
ADMIN_BUTTON_WORK_WITH_DB= '🗄Work with DB🗄'


ADMIN_BUTTON_UNBLOCK_USER = 'Разблокировать️'
ADMIN_BUTTON_DELETE_USER = 'Удалить️'

# adding buttons
ADMIN_BUTTON_ADD_WORD= '🔤Добавить слово'
ADMIN_BUTTON_ADD_MEDIA= '🏞️Добавить media'
ADMIN_BUTTON_ADD_TEST= '❓Добавить тест'
ADMIN_BUTTON_ADD_HOMEWORK= '🏠Добавить домашнее задание'
ADMIN_BUTTON_ADD_TASK= '📌Назначить задание'
ADMIN_BUTTON_ADD_TASK_SHEMA= '📌Назначить задание по схеме'
ADMIN_BUTTON_ADD_TASK_MEDIA= '📌Назначить задание медиа(тест)'
# confirmation
ADMIN_BUTTON_CONFIRM_DATA="✅Все верно"
ADMIN_BUTTON_NO_CONFIRM_DATA="❌Сначала"

# adding menu welcomes
ADMIN_ADDING_MENU_WELCOME='Welcome to admin adding menu!'

# adding word
ADM_ADD_WORD_WORD = 'Введите (напечатайте) слово c клавиатуры:'
ADM_ADD_WORD_WORD_FIND = 'Введенное слово уже есть в базе данных, введите другое слово:'
ADM_ADD_WORD_LEVEL = 'Выберите уровень изучения для слова:'
ADM_ADD_WORD_PART = 'Выберите часть речи введенного слова:'
ADM_ADD_WORD_INV_KB = 'Печатать не нужно. Пожалуйста, выберите уровень из представленных значений:'
ADM_ADD_WORD_DEFINITION = 'Введите определение на английском (definition):'
ADM_ADD_WORD_TRANSLATION = 'Введите перевод на русском языке:'
ADM_ADD_WORD_INV_LEN = ('{}\nДлина введенного текста - {}. '
                        'Ограничение длины для корректной работы - 192 символа!\n\n'
                        'Сократите длину и попробуйте еще раз')
ADM_INV_INP_WORD_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_INV_INP_WORD_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_INV_INP_WORD_ADDED = 'Слово {} добавлено в базу данных.'
ADM_INV_INP_WORD_ERROR = 'Ошибка при записи слова в базу данных, обратитесь к администратору'
ADM_INV_INP_WORD_WORD_AGAIN = 'Предыдущий ввод отменен. Введите слово заново:'



# adding media
ADM_ADD_MEDIA_WORD = 'Выберите слово или введите его c клавиатуры:'
ADM_ADD_MEDIA_COLLOCATION = 'Введите (напечатайте) коллокацию для слова:'
ADM_ADD_MEDIA_LEVEL = 'Выберите уровень коллокации'
ADM_ADD_MEDIA_WORD_NOT_FIND = 'Слово не найдено, введите часть или выберите из найденных:'
ADM_ADD_MEDIA_MEDIA = f'Добавьте текст, фото, видео (если фото и видео можете добавить подпись - субтитры)'
ADM_ADD_MEDIA_INV_KB = 'Печатать не нужно. Пожалуйста, выберите уровень из представленных значений:'
ADM_ADD_MEDIA_DAY =  ('Выберите день изучения (или введите с клавиатуры) '
                      'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_MEDIA_DAY_REP =  ('Выберите день изучения (или введите с клавиатуры ЦИФРУ) '
                         'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_MEDIA_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_ADD_MEDIA_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_MEDIA_ERROR = 'Ошибка при записи в базу данных, обратитесь к администратору'
ADM_ADD_MEDIA_ADDED = 'Медиа для слова {} (коллокация {}) добавлено в базу данных.'
ADM_ADD_MEDIA_WORD_AGAIN = 'Создаем collocation заново, выбирайте слово или напечатайте его или его часть:'


# adding test

ADM_ADD_TEST_TEST = 'Выберите слово или введите его c клавиатуры:'
ADM_ADD_TEST_WORD_NOT_FIND = 'Слово не найдено, введите часть или выберите из найденных:'
ADM_ADD_TEST_DAY =  ('Выберите день изучения (или введите с клавиатуры) '
                      'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_TEST_DAY_REP =  ('Выберите день изучения (или введите с клавиатуры ЦИФРУ) '
                         'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_TEST_TYPE = 'Выберите тип теста'
ADM_ADD_TEST_TYPE_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_TEST_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_ADD_TEST_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_TEST_ERROR = 'Ошибка при записи в базу данных, обратитесь к администратору'
ADM_ADD_TEST_ADDED = 'Тест для слова {} (тип {}) добавлено в базу данных.'
ADM_ADD_TEST_WORD_AGAIN = 'Создаем тест заново, выбирайте слово или напечатайте его или его часть:'


ADM_CONFIRM='✅CONFIRM✅'
# adding task

ADM_ADD_TASK = 'Выберите пункт способ назначения'
ADM_ADD_TASK_WORD = 'Выберите слово'
ADM_ADD_TASK_MEDIA = 'Выберите коллокацию'
ADM_ADD_TASK_WORD_AGAIN = 'Попробуем заново. Выберите слово'
ADM_ADD_TASK_MEDIA_AGAIN = 'Попробуем заново. Выберите коллокацию'
ADM_ADD_TASK_USERS = 'Выберите кому назначить задание'
ADM_ADD_ADDING_MORE = 'Выбирайте чего-нибудь и подтвердите выбор'
ADM_ADD_ADDING_NOTHING = 'Вы ничего не выбрали, выбирайте еще и подтвердите выбор'
ADM_ADD_TASK_DAY = 'А теперь выберите дату начала схемы изучения или введите в формате ДД.ММ.ГГГГ'
ADM_ADD_TASK_DAY_REP = 'Выберите дату или проверьте формат: ДД.ММ.ГГГГ'
ADM_ADD_TASK_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_ADD_TASK_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_TASK_ERROR = 'Ошибка при записи в базу данных, обратитесь к администратору'

ADM_ADD_TASK_ADDED_WORD = 'Задание по схемам по словам\n{}\nдля\n{}\nдобавлено в базу данных!'
ADM_ADD_TASK_ADDED_MEDIA = 'Задание по изучению коллокации \n{}\nдля\n{}\nдобавлено в базу данных!'
ADM_ADD_TASK_AGAIN = 'Создаем тест заново, выбирайте слово или напечатайте его или его часть:'

# adding homework

ADM_ADD_HOMEWORK_HOMETASK = 'Напишите домашнее задание'
ADM_ADD_HOMEWORK_HOMETASK_AGAIN = 'Давайте сначала. Напишите домашнее задание'
ADM_ADD_HOMEWORK_USERS = 'Выберите кому назначить задание'
ADM_ADD_HOMEWORK_MORE = 'Выбирайте чего-нибудь и подтвердите выбор'
ADM_ADD_HOMEWORK_NOTHING = 'Вы ничего не выбрали, выбирайте еще и подтвердите выбор'
ADM_ADD_HOMEWORK_DAY = 'А теперь выберите дату до которой необходимо выполнить дз или введите в формате ДД.ММ.ГГГГ'
ADM_ADD_HOMEWORK_DAY_REP = 'Выберите дату или проверьте формат: ДД.ММ.ГГГГ'
ADM_ADD_HOMEWORK_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_ADD_HOMEWORK_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_HOMEWORK_ERROR = 'Ошибка при записи в базу данных, обратитесь к администратору'
ADM_ADD_HOMEWORK_ADDED = 'Домашнее задание \n{}\nдля\n{}\nдобавлено в базу данных!'
ADM_ADD_OMEWORK_AGAIN = 'Создаем тест заново, выбирайте слово или напечатайте его или его часть:'

# placeholder
MAIN_MENU_PLACEHOLDER='Press button or write smth...'

DIMA_TEST_BUTTON='Dima Test Button'

TEST_BUTTON='🤯временная тестовая кнопка🤯'
TO_MAIN_ADMIN_MENU= '❌Перейти в главное меню'
TO_MAIN_MENU= '❌Отменить и перейти в главное меню'
PASS_EMPTY='⭕Пропустить (оставить пустым)'
CHOOSING_CONFIRM='✅Закончить выбор и продолжить'



DONE= 'Готово!'